spec/examples/payments/list_response.json

[
  {
    "id": 23,
    "organization": 2,
    "amount": "0.0000",
    "currency": "UGX",
    "payment_type": "money",
    "metadata": null,
    "description": "Test Payments",
    "phone_nos": [],
    "state": "processed_with_errors",
    "last_error": "Error with payment 21. Error: (1062, \"Duplicate entry '6-2013-08-29 14:27:43-5000.0000' for key 'account_id_2'\") Type: IntegrityError",
    "rejected_reason": null,
    "rejected_by": null,
    "rejected_time": null,
    "cancelled_reason": null,
    "cancelled_by": null,
    "cancelled_time": null,
    "created": "2013-08-29T14:27:42Z",
    "author": 2,
    "modified": "2013-09-29T23:26:02Z",
    "updated_by": 1,
    "start_date": "2013-08-29T00:00:00Z"
  },
  {
    "id": 24,
    "organization": 2,
    "amount": "0.0000",
    "currency": "UGX",
    "payment_type": "money",
    "metadata": null,
    "description": "Trying to re-create \"Track Payments\" bug",
    "phone_nos": [],
    "state": "processed_with_errors",
    "last_error": "Error with payment 23. Error: (1062, \"Duplicate entry '6-2013-08-29 15:15:55-5000.0000' for key 'account_id_2'\") Type: IntegrityError",
    "rejected_reason": null,
    "rejected_by": null,
    "rejected_time": null,
    "cancelled_reason": null,
    "cancelled_by": null,
    "cancelled_time": null,
    "created": "2013-08-29T15:15:54Z",
    "author": 2,
    "modified": "2013-09-29T23:26:02Z",
    "updated_by": 1,
    "start_date": "2013-08-29T00:00:00Z"
  },
  {
    "id": 3601,
    "organization": 2,
    "amount": "30.0000",
    "currency": "UGX",
    "payment_type": "money",
    "metadata": null,
    "description": "Per diem payment",
    "phone_nos": [
      "+256772781923"
    ],
    "state": "processed",
    "last_error": null,
    "rejected_reason": null,
    "rejected_by": null,
    "rejected_time": null,
    "cancelled_reason": null,
    "cancelled_by": null,
    "cancelled_time": null,
    "created": "2014-11-30T14:49:04Z",
    "author": 2,
    "modified": "2014-11-30T14:49:41Z",
    "updated_by": null,
    "start_date": "2014-11-30T14:49:04Z"
  },
  {
    "id": 3602,
    "organization": 2,
    "amount": "100.2000",
    "currency": "UGX",
    "payment_type": "money",
    "metadata": null,
    "description": "Per diem payment",
    "phone_nos": [
      "+256773712831"
    ],
    "state": "processed",
    "last_error": null,
    "rejected_reason": null,
    "rejected_by": null,
    "rejected_time": null,
    "cancelled_reason": null,
    "cancelled_by": null,
    "cancelled_time": null,
    "created": "2014-11-30T15:31:49Z",
    "author": 2,
    "modified": "2014-11-30T15:32:42Z",
    "updated_by": null,
    "start_date": "2014-11-30T15:31:49Z"
  }
]