spec/examples/webhooks/payments/create_response.json

{
  "id": 3607,
  "organization": 2,
  "amount": "100.2",
  "currency": "UGX",
  "payment_type": "money",
  "metadata": {
    "id": "1234",
    "name": "Lucy"
  },
  "description": "Per diem payment",
  "phone_nos": [
    "+256773712831"
  ],
  "state": "new",
  "last_error": null,
  "rejected_reason": null,
  "rejected_by": null,
  "rejected_time": null,
  "cancelled_reason": null,
  "cancelled_by": null,
  "cancelled_time": null,
  "created": "2014-11-30T16:08:25.421Z",
  "author": 2,
  "modified": "2014-11-30T16:08:25.422Z",
  "updated_by": null,
  "start_date": "2014-11-30T16:08:25.422Z"
}